Merge pull request #16 from kanchengw/dev
fix bugs
